---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTable.Remove(Autodesk.Revit.DB.ExportFontKey)
zh: 删除、移除
source: html/c0b78086-76f6-5e40-1f92-23da17c7a324.htm
---
# Autodesk.Revit.DB.ExportFontTable.Remove Method

**中文**: 删除、移除

Removes the pair (key, info) by font key.

## Syntax (C#)
```csharp
public void Remove(
	ExportFontKey exportFontKey
)
```

## Parameters
- **exportFontKey** (`Autodesk.Revit.DB.ExportFontKey`) - The export font key.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null